int main() {
    int* p = (int*)malloc(10 * sizeof(int));
    int i; printf("P = 0x%p\n", p);
    for (i = 0; i < 10; i++)
    {
        p[i] = i;
    }
    //printf("P[15] =%d\n", *(p+15));
    //printf("P[0] =%d\n", *p);
    free(p);
    printf("P = 0x%p\n", p);
    printf("P[0] =%d\n", *p);
    //printf("P[15] =%d\n", *(p+15));
    return 0;
}
// آن حافظه از دست ما خارج می شود و مقادیرش نیز تغییر می کند
// مقدار پی 15 قبل و بعد از ازاد کردن حافظه یکسان است
// چون کلمپایلر زبان سی چک نمی کند که چیزی که ما با آن کار می کنیم در داخل محدوده آرایه هست یا نیست

